{
  "fields": [
    {"type":"int","id":"_id"},
    {"type":"text","id":"nome"},
    {"type":"text","id":"descricao"},
    {"type":"text","id":"genero"},
    {"type":"text","id":"autor"},
    {"type":"text","id":"editora"},
    {"type":"numeric","id":"quantidade"},
    {"type":"numeric","id":"preco"}
  ],
  "records": [
    [1, "A Hora da Estrela", "É o último romance da escritora brasileira Clarice Lispector, publicado em 1977. Trata-se de uma obra instigante e original, de cunho autobiográfico, pertencente à Terceira Geração Modernista. É classificada como um romance intimista, também conhecido como romance psicológico, estilo em que a autora se destaca. Afinal, a obra de Clarice é marcada por suas emoções e sentimentos pessoais.", "Romance", "Clarice Lispector", "Livraria José Olympio Editora", 15, 125],
    [2, "Dom Casmurro", "Em Dom Casmurro, o narrador Bento Santiago retoma a infância que passou na Rua de Matacavalos e conta a história do amor e das desventuras que viveu com Capitu, uma das personagens mais enigmáticas e intrigantes da literatura brasileira.", "Romance", "Machado de Assis", "Livraria Garnier (primeira edição)", 22, 25],
    [3, "Macunaima", "Obra-prima do Modernismo brasileiro, Macunaíma foi escrito por Mário de Andrade em 1928 e ainda hoje é um livro fundamental para compreendermos nossa diversidade cultural. Nasceu a partir de uma vasta pesquisa linguística do autor e reflete, por meio da mistura de lendas, mitos e histórias populares, a busca de uma identidade nacional afastada pela colonização.", "Romance, Ficção, Humor", "Mario de Andrade", "Oficinas Gráficas de Eugênio Cupolo", 34, 38],
    [4, "Morte e Vida Severina", "Um dos poemas mais populares de João Cabral de Melo Neto, \"Morte e vida severina\" dá voz aos retirantes nordestinos e ao rio Capibaripe, em cenas fortes e contundentes. Clara crítica social, o autor descreve a viagem de um sertanejo chamado Severino, que sai de sua terra natal em busca de melhores condições de vida. Durante a jornada, Severino se encontra tantas vezes com a Morte que, desiludido e impotente, percebe que a luta é inútil ― como ele, tantos outros severinos padecem com a miséria e o abandono.", "Poesia", "João Cabral de Melo Neto", "TUCA", 31, 80],
    [5, "Senhora", "Obra da fase urbana de José de Alencar, considerado o mestre do romantismo o brasileiro, Senhora revela as convenções da sociedade burguesa carioca do século XIX. Pelos desencontros amorosos de Aurélia Camargo, Fernanda Seixas e Adelaide Amaral, o autor traça um painel da vida da corte e critica os costumes da época, como casamento por interesse e arrivismo social.", "Ficção, Romance", "José de Alencar", "B. L. Garnier", 15, 30],
    [6, "Triste Fim de Policarpo Quaresma", "Policarpo Quaresma ama o Brasil. Ama porque é a terra mais fértil do mundo, porque tem a fauna e a flora mais lindas e exuberantes, porque é a cultura mais rica, a melhor comida, em variedade e sabores, porque possui as mulheres mais belas e, segundo ele, até mesmo... os melhores governantes.", "Ficção", "Lima Barreto", "Typ. \"Revista dos Tribunaes\" (1a. edição)", 12, 50]
  ]
}
